<template>
	<div class="leftBar"></div>
	<div class="main">
		<p id="para1">通过对计算机学科体系结构的梳理，我渐渐对自己的学业有了规划，也就是说，我的学业规划主要从计算机科学的知识体系入手进行制定，同时，我深刻认识到了实践在计算机科学学习中的重要作用，因此，我也会在学业规划中重视实践的作用，在学习基础知识后加以实践。</p>
		<el-divider></el-divider>
		<p id="para2">在写下这个规划的同时，我刚刚结束了大学一年级上学期的学习，在这进入大学的第一个学期中，我基本完成了从一名高中生到大学生的角色转换，也就是说，我在这一学期中适应了大学生活，并且认识到了作为一名大学生，应该极大地发挥自身在学习之中的决定性作用，在丰富多彩的大学生活中选择自己的方向，因此，经历了一学期的大学生活，我深刻认识到了学业规划的重要性。</p>
		<el-divider></el-divider>
		<p id="para3">在上学期，我主要学习了计算机知识体系中的部分数学内容，并且加强了英文的阅读能力，在刚刚结束的计算机科学导论学习中，我对计算机科学本身和其各个分支有了一定的了解，并且有着深厚的兴趣，在计算机科学导论这门课程的学习中，我也锻炼了自己的学习能力和信息查找能力，意识到了英文水平在计算机科学学习中的重要性，同时深知自身现有水平的不足和学科体系的庞大。在这个寒假，我将主要学习算法与数据结构，并且在这过程中锻炼自己的代码能力和程序设计能力，以及将重点尝试自己运用算法解决问题的能力，加强用python和c++实现常见算法与数据结构，因为代码能力在计算机科学学习中尤为重要。</p>
        <el-divider></el-divider>
        <p>在进行近期计划的同时，长期来看，我将继续提高自身的英文水平以更好地使用互联网的资源，开阔自己的眼界，学习不止于考试，我希望我能在学习的同时加强对各个学科的认识和对本门学科所解决的问题的思考，以及本学科在实际应用中的作用。在将来，我也会阅读计算机科学中的许多经典，虽然它们的厚度都令人望而生畏，但我相信，如果静心学习，这些经典能帮助我加强对学科的认识。同时我也会阅读实践应用方面的经典书籍，并且尝试在实践中学习。</p>
        <el-divider></el-divider>
        <p>以上便是我的部分学习规划，我知道没有什么事情是简简单单的，但我仍希望自己能够完成这些规划，提升自身的学识和能力。</p>
	</div>
</template>

<style scoped>
* {
	font-size: 20px;
}

.main {
	position: absolute;
	left: 40vh;
	height: 90vh;
	background-color: #e4f9f5;
	padding: 5vh;
}
.leftBar {
	position: absolute;
	width: 40vh;
	height: 100vh;
	background-color: #409EFF;
}

p {
	text-indent: 2em;
	text-align: left;
}
</style>